rails_api/app/controllers/genres_controller.rb

  def show
    @genres = Genre.get_genres
    @genres.first[1..-1].first.each do |genre|
      # "1..-1"" is to exclude the first element in the array, since we do not need it
      Genre.create(
        id: genre["id"],
        name: genre["name"]
      )
---
INSERT INTO "genres" ("id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id", 28], ["name", "Action"], ["created_at", "2017-06-13 20:11:00.757002"], ["updated_at", "2017-06-13 20:11:00.757002"]]