rails_api/app/controllers/movies_controller.rb

  def show
    begin
      @movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 321612], ["LIMIT", 1]]

  def destroy
    begin
      @movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 126889], ["LIMIT", 1]]